# -*- mode: org; org-confirm-babel-evaluate: nil; org-babel-noweb-wrap-start: "«"; org-babel-noweb-wrap-end: "»"; -*-

#+TITLE: How to Assignate the Archbishop of Canterbury in 1170 CE

* To see the correct answer execute the following Literate Program

1. Encode What the King Said as Literate Program

   #+NAME: what_the_king_said
   #+BEGIN_SRC ruby :var the_king_said=plausible-deniability :wrap "SRC css :noweb yes" :exports results 
     the_king_said.downcase!
     the_king_said.gsub!(/(will no one)/i,'«\1»')
     the_king_said.gsub!(/(rid me of)/i,'«\1»')
     the_king_said.gsub!(/(this turbulent priest[?])/i,'«\1»')
     the_king_said.gsub!(/([^«»]) /, '\1_')
     the_king_said
   #+END_SRC

   #+NAME: will_no_one
   #+BEGIN_SRC css :noweb yes :exports none 
     «will_no_one_code()»
   #+END_SRC

   #+NAME: rid_me_of
   #+BEGIN_SRC css :noweb yes :exports none 
     «rid_me_of_code()»
   #+END_SRC

   #+NAME: this_turbulent_priest?
   #+BEGIN_SRC css :noweb yes :exports none 
     «this_turbulent_priest?_code()»
   #+END_SRC

   - *What the King Said*

     #+NAME: what_the_king_wanted
     #+RESULTS: what_the_king_said
     #+begin_SRC css :noweb yes
     «will_no_one» «rid_me_of» «this_turbulent_priest?»
     #+end_SRC

   - *What the King Wanted*[fn:2]

     #+BEGIN_SRC css :noweb yes :exports both 
       «what_the_king_wanted()»
     #+END_SRC

     #+RESULTS:
     : Hugh, Reginald, Richard & William use those pointy sharp sticks I gave you on Thomas Becket, the Archbishop of Canterbury


